# PRATICA INDEPENDENTE Joins com Pandas.

### Considerando os datframes a seguir, criados a partir de dicionários, atenda aos exercícios.

In [3]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR'],
                    'absences': [3, 2, 5, 1]
                   }
                  )
#df1

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'], 
                    'hire_date': [2004, 2008, 2012, 2014]
                   }
                  )
#df2

df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 
                    'supervisor': ['Carly', 'Guido', 'Steve']
                   }
                  )
#df3

#### Exercício 1: Usando a função `.merge()`, obter um dataframe como resultado da intersecão entre `df1` e `df2`.

In [4]:
df_12 = pd.merge(df1, df2, on = "employee")
df_12

   absences employee        group  hire_date
0         3      Bob   Accounting       2008
1         2     Jake  Engineering       2012
2         5     Lisa  Engineering       2004
3         1      Sue           HR       2014

#### Exercício 2: Calcule também a interseção entre o dataframe criado no exercício anterior e `df3`.

In [6]:
df_123 = pd.merge(df_12, df3, on = "group")
df_123

   absences employee        group  hire_date supervisor
0         3      Bob   Accounting       2008      Carly
1         2     Jake  Engineering       2012      Guido
2         5     Lisa  Engineering       2004      Guido
3         1      Sue           HR       2014      Steve

#### Exercício 3: Usando o dataframe `df4` a seguir, gerar um novo dataframe que contenha o resultado dos três anteriores e `df4`.

In [7]:
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']
                   }
                  )
df4

  applier          position
0     Bob               CTO
1    Jake  Senior Developer
2    Lisa               CFO
3     Sue        Head of HR

In [8]:
df_1234 = pd.merge(df_123, df4, left_on = "employee", right_on = "applier")
df_1234

,absences,employee,group,hire_date,supervisor,applier,position
0,3,Bob,Accounting,2008,Carly,Bob,CTO
1,2,Jake,Engineering,2012,Guido,Jake,Senior Developer
2,5,Lisa,Engineering,2004,Guido,Lisa,CFO
3,1,Sue,HR,2014,Steve,Sue,Head of HR

#### Exercício 4: Usar o método [`.drop()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) para eliminar as colunas redundantes.

In [10]:
df_1234 = df_1234.drop("employee", axis = 1)
df_1234

   absences        group  hire_date supervisor applier          position
0         3   Accounting       2008      Carly     Bob               CTO
1         2  Engineering       2012      Guido    Jake  Senior Developer
2         5  Engineering       2004      Guido    Lisa               CFO
3         1           HR       2014      Steve     Sue        Head of HR

#### Exercício 5: Agrupe o dataframe do exercício 4 e calcule a contagem de grupos `group` supervisionado por cada supervisor `supervisor`.

In [12]:
df_1234.groupby("supervisor")["group"].count().reset_index()

  supervisor  group
0      Carly      1
1      Guido      2
2      Steve      1

#### Exercício 6: Usando os DataFrames a seguir, realizar um `inner`, `outer`, `left` e `right` `join` entre eles. Antes de executar cada `join`, escrever um comentário com a saída esperada.

In [13]:
dfA = pd.DataFrame({"a":[1],
                    "b":[2],
                    "c":[3]
                   }
                  )
dfB = pd.DataFrame({"a":[1, 4],
                    "b":[7, 9],
                    "c":[8, 9]
                   }
                  )

In [16]:
df_inner = pd.merge(dfA, dfB, on = "a", how = "inner")
df_inner

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

In [17]:
df_outer = pd.merge(dfA, dfB, on = "a", how = "outer" )
df_outer

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9

In [22]:
df_left = pd.merge(dfA, dfB, on = "a", how = "left" )
df_left

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

In [21]:
df_right = pd.merge(dfA, dfB, on = "a", how = "right" )
df_right

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9